Revit 2027 API
ElementId.Compare Method
Compares two element ids.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Compare(
	ElementId id
)
Public Function Compare (
	id As ElementId
) As Integer
public:
int Compare(
	ElementId^ id
)
member Compare :
        id : ElementId -> int
Parameters
id ElementId
The ElementId to be compared with this ElementId.
Return Value
Int32
-1 if this element id is less than id, 0 if equal, 1 if greater.
See Also
Reference
ElementId Class
Autodesk.Revit.DB Namespace